app/views/catalogs/browse.html.erb

SELECT "items".* FROM "items" WHERE "items"."catalog_id" = 1
---
				//load the next set of 12 divs
				$.getJSON( "/catalogs/<%=@catalog.id%>/batch_of_items", {page : currentPage+1, size : 3}, function(data) {
					var numItemsLoaded = 0;

					if (data.items==null || data.items.length==0) {
						//end of the list, hide the loading box
						$('.loading_box').hide();
					}
					else {
						// set the current max page to the page just returned from json, sort of a sanity check
						currentPage=parseInt(data.page);

						// grab the row container that we will add our new items to
						var rowContainer = $('.items .row');

						// grab the first item from the row, we are going to be lazy and clone it to add new ones
						// this way we don't have to embed html for the div and img elements in the js
						var itemToClone = $('.item', rowContainer).first();

						// loop through each item and add a new div to the end of the current list of items
						$.each(data.items, function( i, item ) {
							var newitem = itemToClone.clone();