app/controllers/catalogs_controller.rb

SELECT "catalogs".* FROM "catalogs" WHERE "catalogs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def browse
    @catalog = Catalog.find(params[:id])